# SetDGNExportOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDGNSettings..::..SetDGNExportOptions Method
ExportDGNSettings Class See Also
---
Sets the options stored in these settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetDGNExportOptions(
	DGNExportOptions options
)
```

Visual Basic
---
```text
Public Sub SetDGNExportOptions ( _
	options As DGNExportOptions _
)
```

Visual C++
---
```text
public:
void SetDGNExportOptions(
	DGNExportOptions^ options
)
```

# ### Parameters
options
    Type: Autodesk.Revit.DB..::..DGNExportOptions The options.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportDGNSettings Class
Autodesk.Revit.DB Namespace